&НаКлиенте
Процедура ПоказатьРекомендацию(Команда) 
	
ОстаемсяДома = (Температура < -30 Или Температура > 30 Или ШтормовоеПредупреждение) И Не ОбязательноБытьВОфисе;

Если ОстаемсяДома Тогда
Сообщить("Оставайтесь дома!");
ИначеЕсли Температура < -10 Тогда
Сообщить("Наденьте зимнюю верхнюю одежду!");
ИначеЕсли Температура >= -10 И Температура <= 15 Тогда
Сообщить("Наденьте демисезонную верхнюю одежду!");
ИначеЕсли Температура > 15 Тогда
Сообщить("Наденьте летнюю верхнюю одежду!");
    КонецЕсли;

Если (Снег Или Гололед) И Не ОстаемсяДома Тогда
Сообщить("Добирайтесь общественным транспортом!");
	КонецЕсли;	
КонецПроцедуры
